Repository: SpongePowered/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/admins/implementations.po
Languages: de

source: Sponge Implementations
de: Sponge Einbettung

source: So, you perhaps want to take the giant leap and move from a Bukkit server to Sponge. Here are the options you have for setting up a Sponge server. The following Guides will walk you through all you need to do to accomplish this lofty goal.
de: So, du willst also vielleicht eine große Leine in die Hand nehmen und deinen Bukkitserver zu einem Spongeserver machen. Hier sind mehrere Optionen aufgelistet um einen Spongeserver aufzusetzen. Der folgende Leitfaden wird dich durch alle Schritte bis zu deinem lang ersehnten Ziel führen.

source: Sponge as a Forge CoreMod
de: Sponge als Forge CoreMod

source: The First release of a Sponge API Implementation is planned to be a Forge Server CoreMod.
de: Das erste Release der Sponge API Einbettung ist geplant als Forge Server CoreMod.

source: *The Forge Sponge Implementation is not ready yet, it is still a work in progress.*
de: *Die Forge Sponge Einbettung ist noch nicht fertig und die Arbeiten daran sind noch im Gange.*

source: Please note that Sponge is intended to be implemented for *Minecraft version 1.8* and above. There is no guarantee of backward compatibility with earlier versions of Minecraft Forge.
de: Bitte bemerk, dass Sponge beabsichtigt eine Einbettung für *Minecraft Version 1.8* und höher zu sein. Es gibt keine Garantie auf Abwärtskompatibilität mit früheren Versionen von Minecraft Forge.

source: How to install Sponge on your Forge server is described in detail at :doc:`server-setup`
de: Wie du deinen Sponge Server in einen Forge Server einbaust ist genauer im :doc:`server-setup` Teil beschrieben.

source: Sponge as a stand-alone server
de: Sponge als selbstständiger Server

source: There are currently no plans for a stand-alone Sponge API Implementation (like *Craftbukkit*). Anyone interested in creating such a project is most welcome to do so.
de: Es gibt derzeit keine Pläne einen selbstständigen Sponge Server zu machen (sowie Bukkit). Jeder der daran interessiert ist, kann gerne selbst einen entwickeln.

source: Sponge as a mod for other servers
de: Sponge als Mod für andere Server

source: There are currently no plans for a Sponge API implementation for CanaryMod, Granite, Rainbow, or in fact any other Minecraft server environment. Anyone interested in starting any of these projects is most welcome to do so.
de: Es gibt derzeit keine Pläne für eine Einbettung von Sponge in den CanaryMod, Granite, Rainbow oder in eine andere Minecraft Server Umbegung. Jeder der daran interessiert ist, kann gerne selbst eine entwickeln.

source: The Sponge developers would like to create a Glowstone implementation, but there are no concrete plans to do so at this point in time.
de: Die Sponge Entwickler würden gerne eine Glowstone Einbettung machen, haben aber derzeit noch keine konkreten Pläne dazu.
