Repository: SpongePowered/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/developers/contributing-to-sponge.po
Languages: de

source: Contributing to Sponge
de: Mitwirken bei Sponge

source: Prerequisites
de: Vorraussetzungen

source: The setup required to develop plugins for Sponge is quite simple and requires three things.
de: Es ist sehr einfach alles so einzustellen, dass du mit dem Entwickeln deines eigenen Sponge Plugins anfangen kannst. Es braucht nur drei Dinge.

source: Java JDK installed
de: Das Java JDK muss installiert sein

source: Editor of your choice installed
de: Ein Bearbeitungsprogramm deiner Wahl muss installiert sein

source: git client installed
de: Der GIT Client muss installiert sein

source: Java JDK download
de: Download des Java JDK

source: Download the JDK from Oracle first.
de: Downloade zuerst das JDK von Oracle.

source: We recommended that you first check that you only have one version of Java installed at any point in time. Please begin by uninstalling any old versions of Java you may have acquired in the past.
de: Wir empfehlen, dass du erst überprüfst, dass du nur eine Version von Java installiert hast. Falls dies nicht der Fall ist, deinstallier die alten Versionen von Java, die du in der Vergangenheit brauchtest.

source: Then visit this site: http://www.oracle.com/technetwork/java/javase/downloads/index.html
de: Besuch dann diese Seite: http://www.oracle.com/technetwork/java/javase/downloads/index.html

source: Download and install the Java JDK. It's the upper blue button on the right-hand side of the main column. real If you cannot find it, try this link for a direct Java 7 JDK download: http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html
de: Downloade und installiere das Java JDK. Clicke dafür den blauen Knopf in der oberen Rechten ecke der Tabelle. Falls du ihn nicht findest, kannst du auch diesen Link nutzen, um direkt das Java 7 JDK zu downloaden: http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html

source: Make sure you install the JDK, not the JRE. The JDK, or Java Development Kit, contains crucial tools for creating Java applications.
de: Stell sicher, dass du das JDK, nicht die JRE, installierst. Das JDK, oder Java Development Kit, enthält wichtige Werkzeuge um Java Programme zu erstellen.

source: Let that install, then reboot your PC.
de: Nach dem Installationsvorgang musst du deinen PC neustarten.

source: IDE download
de: IDE (Entwicklungsumbebung) Download

source: The second main download you need to perform is getting your IDE (Interactive Development Environment).
de: Der zweite Download, den du machen musst, ist um eine IDE zu bekommen. (Interactive Development Environment = Interaktive Entwicklungs Umgebung)

source: There are two commercially available IDEs that we provide instructions for; Eclipse, and IntelliJ IDEA. Which one you choose is a matter of personal preference, and you might even prefer an IDE that isn't listed here. That's up to you.
de: Es gibt zwei IDEs, für die wir weitere Anweisungen anbieten: Eclipse und IntelliJ IDEA. Welche dieser du nutzt, ist deine persönliche Entscheidung. Vielleicht nutzt du auch eine IDE, die hier nicht aufgelistet ist. Das ist komplett dir überlassen.

source: You can download Eclipse here: https://eclipse.org/downloads/ (Choose "Eclipse IDE for Java Developers")
de: Du kannst Eclipse hier downloaden: https://eclipse.org/downloads/ (Choose "Eclipse IDE for Java Developers")

source: You can download IntelliJ IDEA here: https://www.jetbrains.com/idea/download/ (Choose the "Community Version" unless you want to pay for the Ultimate Edition. You do not need the Ultimate Edition to develop plugins, as the Community Version still contains all the tools you need.)
de: Du kannst die IntelliJ IDEA hier downloaden: https://www.jetbrains.com/idea/download/ (Choose the "Community Version" Es sei denn du möchtest die Ultimate Edition kaufen. Die brauchst du aber nicht um Plugins zu entwickeln. Die Community Version enthält alles, was du brauchst.

source: The download page for git is here: http://git-scm.com/downloads
de: Die Downloadseite für Git findest du hier: http://git-scm.com/downloads

source: Make sure to install the appropriate version for your operating system.
de: Stell sicher, dass du die passende Version für dein Betriebssystem nutzt.

source: Linux users, git will be available on your distro's package manager, usually under the name "git".
de: Linux Benutzer: Git ist sicherlich unter deinem Packagemanager verfügbar. Normalerweise unter dem Namen "git".

source: Install it like any other application, and reboot.
de: Installier es wie jede andere Anwendung und starte dein System neu.

source: Running Gradle
de: Die Benutzung von Gradle

source: Once these are downloaded, installed, and you've rebooted (again), then you can begin to setup the workspace specific for Sponge.
de: Wenn diese gedownloaded sind, installiert sind und du dein System neugestartet hast, kannst du damit beginnen deinen Workspace für Sponge aufzusetzen.

source: (We're going to assume that your `PATH` is correct as well, each operating system has its own way of specifying new directories to search for commands. In Unix-based systems the environment variable is `$PATH`. In Windows systems it is `%PATH%`%. It's advised to construct your profile in your system such that when you login to the computer, the `PATH` is setup correctly vs. manually updating the `PATH` before working with Sponge)
de: (Wir gehen davon aus, dass deine `PATH` Variable korrekt gesetzt ist. Jedes Betriebssystem hat eine eigene Art die neuen Ordner für Befehle zu organisieren. Unix-basierte Systeme nutzen dafür die `$PATH` Variable. In Windows ist es `%PATH%`%. Es ist empfohlen dein System so einzustellen, dass die `Path` Variable automatisch bei jedem Neustart korrekt gesetzt wird, damit man sie nicht manuell setzen muss.

source: To get Sponge and built, now we need to use `git` and the tools we just downloaded:
de: Um Sponge zu bekommen und damit zu arbeiten brauchst du `git` und die anderen Werkzeuge, die wir gerade gedownloaded haben:

source: Before we begin with that, a few words of advice:
de: Bevor wir damit anfangen hier ein paar vorrausgehende Worte:

source: Spaces in filenames are not ideal. Please do not use whitespace in filenames. As such, putting your repository into say, the Desktop, or in folders that contain whitespace filenames is a bad idea.
de: Leerzeichen in Dateinamen sind nicht empfehlenswert. Bitte nutze auch keine Whitespaces mit der Tabtaste. Außerdem ist es eine schlechte Idee deinen Workspace oder dein Repositorium auf deinen Desktop oder einen Ordner mit Leerzeichen im Pfad zu setzen.

source: Keep the paths to your source tree as short as possible::
de: Versuche die Pfade zu deinem Softwarebaum so kurz wie möglich zu halten::

source: Now you're ready to begin the process of getting Sponge sources and beginning to build it for the first time. Refer to the README.md page for the Sponge project for the most current version of instructions, but these steps are generally going to be the same throughout the development of Sponge::
de: Jetzt bist du bereit die Sponge Dateien zu holen und das erste mal etwas damit zu bauen. Hiermit verweisen wir auf die README.md Datei auf der Hauptseite des Sponge Projektes, auf der immer die aktuellen Anweisungen stehen, wie du damit umgehen musst, obwohl sich diese nicht sehr voneinander unterscheiden sollten.

source: That will create a clone of the Sponge project on your PC. The process will create the directory Sponge::
de: Wenn du die Anweisungen dort befolgt hast, wird ein neuer Klon von Sponge auf deinem PC angelegt.Dieser Prozess wird einen neuen Ordner für Sponge anlegen::

source: We need to update the project by fetching the submodules linked to Sponge, namely the SpongeAPI module::
de: Wir müssen jetzt noch das Projekt updaten, indem wir die submodels, die in Sponge eingebaut sind mit einflechten. Nämlich vor das SpongeAPI Modul::

source: There is a commit-hook that is used to process checkins to the repository, we need to put a copy of that hook in the `git` hooks folder::
de: Es gibt einen Commit-Hook, der es ermöglicht den Code in dem Repositorium zu prüfen. Dafür müssen wir eine kopie dieses Hooks in den `git` hooks Ordner legen::

source: (With Unix-based systems the command is just the same, but using cp and the path separators are /)::
de: (Auf Unix-basierten Systemen ist der befehl der gleiche, aber du musst `cp` nutzen und die Pfadspalter sind /)::

source: At this point you can begin to setup the workspace with gradle (which you do NOT need to download or install)
de: Nun kannst du beginnen den Workspace mit Gradle aufzusetzen (was du übrigends weder downloaden noch installieren musst)

source: The catch is that the gradle build process needs to be aware of the location of your Java compiler. So before running gradle for the first time to setup the workspace, we need to specify the environment variable ``JAVA_HOME``.
de: Das Problem ist, dass Gradle den Pfad des Java Compilers braucht. Wir müssen also, bevor wir Gradle nutzen können um den Workspace aufzusetzen, die Umgebungsvariable ``JAVA_HOME`` korrekt einstellen.

source: ``JAVA_HOME`` is an environment variable that is set in the shell. You can set this up once in your login process for your PC or manually set it each time you run gradle. I prefer to put it into my per-login process so I don't need to manually set it.
de: ``JAVA_HOME`` ist eine Umgebungsvariable die in der Shell gesetzt wird. Diese kann automatisch beim Loginprozess, nach dem PCStart, gesetzt werden oder manuell.

source: ``JAVA_HOME`` is a directory to where the JDK is installed:
de: ``JAVA_HOME`` ist der Ordner indem du das JDK installiert hast:

source: If you installed Java as shown above then the JAVA_HOME would be set like this::
de: Falls du Java so wie oben installiert hast, sollte die JAVA_HOME Variable ca so aussehen::

source: (jdk1.7.0.67 is the version I have at the moment, your version will differ if the download is recent)
de: (jdk1.7.0.69 ist derzeit die Version, die ich nutze, deine Version wird vermutlich anders sein.)

source: To see exactly what the version (path) is then just type::
de: Um genau zu sehen, wie der Versionspfad ist, tippe einfach::

source: and inspect the output for the name of the directory that contains the JDK.
de: und untersuche die Ausgabe nach dem Namen des Ordners der das Java JDK enthält.

source: Once JAVA_HOME is set then we can run gradle to setup the workspace:
de: Wenn JAVA_HOME gesetzt ist können wir Gradle starten, damit es den Workspace aufsetzt:

source: This process will do several things:
de: Dieser Prozess wird mehrere Dinge zun:

source: It will download jar files that are required for Sponge to build. It will download Forge which is required for Sponge to build.
de: Es wird die Jar-Dateien downloaden, die notwendig sind um Sponge zu bauen. Außerdem wird es Forge downloaden, dass ebenfalls von Nöten ist.

source: (remember we're building Sponge, not plugins for Sponge)
de: (Erinnerung: Wir bauen Sponge, nicht Plugins für Sponge)

source: Sponge plugins DO NOT need Forge to build (nor should they ever need Forge to build).
de: Sponge Plugins BRAUCHEN NICHT Forge um gebaut zu werden. (Sie sollten niemals Forge nutzen)

source: This process will take a few minutes depending on your network connection. It is a process that requires a network connection so be sure you are online for that step.
de: Dieser Prozess wird ein paar Minuten dauern, es kommt auf deine Internetverbindung an. Er benötigt eine Internetverbindung, also stelle sicher, dass du online bist.

source: At this point the output will end with a message like this::
de: Hier wird die Ausgabe mit einer Nachricht wie dieser enden::

source: Next Steps
de: Weitere Schritte

source: From here you should follow the steps on the SpongePowered/Sponge README.md file to configure your IDE (Eclipse or InteliJ) to import the Sponge Project and build/run the Sponge Artifact within the IDE.
de: Von hier an solltest du den Schritten aus der SpongePowered/Sponge README.md Datei folgen um deine IDE (Eclipse oder IntelliJ) so einzustellen, dass sie mit Sponge arbeiten kann.

source: The next wiki article on [[Debugging Sponge Within the IDE]] will explain how to setup your IDE to start, run and debug Sponge within the IDE.
de: Der nächste Wikiartickel ist über [Debugging Sponge Within the IDE]] (Debuggen von Sponge in der IDE) und wird dir erklären, wie du deine IDE aufsetzen musst, um Sponge zu starten und damit zu arbeiten.
