Repository: SpongePowered/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/developers/plugin-lifecycle.po
Languages: de

source: Plugin Lifecycle
de: Plugin Lebenszyklus

source: Loading and other pre-plugin events
de: Laden und andere Vor-Plugin Events

source: Prior to any plugin-visible states, the plugin loader finds the available plugins, determines if all dependencies are satisfied, and sorts plugins by dependency order. All lifecycle events are given to plugins in this order, such that plugin A containing "[required-]after:B" will get each event after plugin B has completed any work it is doing for that state. Additionally, all lifecycle states are global: all plugins visible to each other in any manner must be transitioned through all stages at once.
de: Bevor ein eine Aktion eines Plugins eintritt überprüft der Plugin Loader alle Plugins, untersucht, ob alle Abhängigkeiten vorhanden sind und sortiert Plugins nach deren Abhängigkeitsreihenfolge. Alle Lebenszyklusevents sind für Plugins in der Reihenfolge gesetzt, dass das Plugin A, welches ein Plugin B benötigt, das Event erst dann bekommt, wenn das Plugin B mit seiner Arbeit mit diesem Event fertig ist. Außerdem sind alle Lebenszykluszustände öffentlich: Alle Plugins die sichtbar für die anderen in irgendeiner Weise sind müssen alle Stationen auf einmal durchlaufen.

source: Initalization states
de: Initialisierungsstationen

source: All the initialization events will occur at most once.
de: Alle Initialisierungsevents werden auf einmal passieren.

source: CONSTRUCTION
de: AUFBAU

source: During the construction stage the ``@Plugin`` class instances for each plugin are created. The primary 'state event' for this stage is the ``@Plugin`` class constructor.
de: Während des Aufbaus wird eine ``@Plugin`` Klassen Instanz von jedem Plugin erstellt. Das erste 'Stationsevent' für diese Station ist der ``@Plugin`` Klassen Konstruktor.

source: PRE_INITIALIZATION
de: VORINITIALISIERUNG

source: Pre-initialization is the time for a plugin to perform any actions it needs to get ready for initialization. The pre-initialization event gives the plugin access to a default logger instance, as well as information on preferred configuration file locations.
de: Vorinitialisierung ist die Zeit in der ein Plugin alles macht um fertig für die Initialisierung zu sein. Das Vorinitialisierungsevent gibt dem Plugin Zugriff auf die standard Logger-Instanz, sowie Informationen über die Plätze der Konfigurationsdateien.

source: INITIALIZATION
de: INITIALISIERUNG

source: Initialization is the stage where the plugin should finish any work it needs to do in order to be essentially functional. Global event handlers and any other registration or information that does not depend on other plugins or a running server instance should be handled at this stage.
de: Initialisierung ist die Station in der das Plugin mit der Arbeit, des es zum funktionieren braucht, fertig sein sollte. Globale Eventhandler und andere Registrationen oder Informationen, welche nicht auf anderen Plugins basieren, sowie das Laufen und nutzen einer Serverinstanz sollten hier behandelt werden.

source: POST_INITIALIZATION
de: NACHINITIALISIERUNG

source: Post-initialization is the stage where most initialization phase inter-plugin communication should occur. All plugins that provide an API should be ready to accept basic requests to their API by this stage.
de: Nach-Initialisierung ist die Station in der die Initialisierungsphase in die Plugin-Zu-Plugin Kommunikation übergehen sollte. Alle Plugins die eine API anbieten sollten nun soweit sein Anfragen an ihre API zu akzeptieren.

source: LOAD_COMPLETE
de: FERTIG MIT LADEN

source: All plugin initialization should be completed before this stage. At this point everything should be ready for a server instance to start.
de: Alles was mit Plugin Initialisierung zutun hat sollte nun beendet sein. Hier sollte nun alles soweit sein, dass die Serverinstanz komplett starten kann.

source: Running states
de: Laufende Stationen

source: These states can occur multiple times during a single run. SERVER_ABOUT_TO_START may follow from SERVER_STOPPED, and in the event of errors during any part of the process SERVER_STOPPED may occur immediately.
de: Diese Stationen können mehrmals in einem Laufvorgang vorkommen. SERVER_ABOUT_TO_START könnte von SERVER_STOPPED kommen und in einem Event Fehler während dem Teil des Prozesses, dass der Server gestoppt wird, auftreten.

source: The server instance exists, worlds are not yet loaded.
de: Die Serverinstanz existiert, die Welten wurden aber noch nicht geladen.

source: The server instance exists, worlds have been loaded.
de: Die Server Instanz existiert, die Welten wurden auch geladen.

source: (Appears to currently happen immediately following SERVER_STARTING?)
de: (Erscheint derzeit direkt nach dem SERVER_STARTING Event und wird eventuell in Zukunft geändert.)

source: Immediately following the final tick, prior to saving.
de: Tritt unmittelbar nach dem letzten Servertick auf, bevor gespeichert wird.

source: Server has been shutdown, possibly by a major error. No players are connected, no changes to the world will be saved.
de: Der Server wurde ausgeschaltet, möglicherweise durch einen großen Fehler. Keine Spieler sind verbunden, keine Änderungen in der Welt werden gespeichert.
