Repository: SpongePowered/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/developers/setting-up-workspace.po
Languages: de

source: Setting up your Workspace
de: Aufsetzen deines Workspaces

source: The Sponge maven repository is at http://repo.spongepowered.org/Sponge/maven/. All sponge artifacts are under the group ID of ``org.spongepowered``.
de: Das Sponge Maven Repositorium ist auf http://repo.spongepowered.org/Sponge/maven/ zu finden. Alle Sponge Artefakte werden unter der Gruppen ID von ``org.spongepowered`` zu finden sein.

source: Artifact IDs are as follows:
de: Artefakt IDs sind die folgenden:

source: the API: ``spongeapi``
de: die API: ``spongeapi``

source: the forge based implementation: ``sponge``
de: die Forge-basierte Einbettung: ``sponge``

source: Sponge plugins can be compiled with `Gradle <http://gradle.org>`__ or `Maven <http://maven.apache.org>`__.
de: Sponge Plugins können mit `Gradle <http://gradle.org>`__ oder `Maven <http://maven.apache.org>`__ compiled werden.

source: The Sponge team recommends the use of Gradle as use of the Forge team's ForgeGradle plugin can allow testing of Sponge inside Eclipse or Intellij IDEA development environments.
de: Das Sponge Team empfiehlt die Benutung von Gradle, da das ForgeGradle Plugin vom Forge Team ein Testen von Sponge innerhalb von Eclipse oder IntelliJ IDEA ermöglicht.

source: Development builds use the SNAPSHOT system
de: Entwickler builds nutzen das SNAPSHOT System

source: `Online Javadocs(Temporary link) <http://spongepowered.github.io/SpongeAPI/>`__
de: `Online Javadocs(Temporärer link) <http://spongepowered.github.io/SpongeAPI/>`__

source: Gradle users place the following in your build.gradle:
de: Gradle Nutzer plazieren bitte das folgende in ihrer build.gradle Datei:

source: Maven users place the following in your pom.xml:
de: Maven Nutzer plazieren bitte das folgende in ihrer pom.xml Datei:
