Repository: SpongePowered/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/faq.po
Languages: de

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: What is Sponge?
de: Was ist Sponge?

source: Sponge is a combination of a new API (likely based off of Spout/Flow’s APIs) implemented on top of Forge, with assistance from other parts of Minecraft’s modding community (Glowstone, etc.). It will be both a server and client API, and its target user base is pretty much anyone that wants to mod their game, including server owners. However, we may focus on the server-side portion first. We invite any developer to help out.
de: Sponge ist eine Kombination einer neuen API (so ähnlich wie Spout / Flow's APIs) eingebettet über Forge, mit unterstützung von anderen Teilen der Minecraft Modding Community (Glowstone, etc.). Es wird eine Server- und Client API, dessen Zielgruppe sogut wie jeder ist, der sein Spiel modifizieren will, sowie Server Besitzer. Jedoch fokussieren wir uns ersteinmal auf die Serverseitigen Teile. Wir laden jeden Entwickler ein uns zu helfen.

source: When will the first downloads be available?
de: Wann wird der erste Download bereitstehen?

source: The release date is still to be announced. However, the API portion is set to be release in November.
de: Das Erscheinungsdatum ist noch nicht bekanntgegeben, jedoch wurde geplant die API Teile des Projektes im November fertig zustellen.

source: Will there be an official place to download plugins?
de: Wird es eine offizielle Seite geben, auf der man Plugins downloaden kann?

source: Yes there will be. The complete details are still being discussed. You can take part of the discussion here https://forums.spongepowered.org/t/plugin-hosting/1150.
de: Ja, wird es. Die meisten Details darüber sind aber noch in Diskussion. Du kannst an dieser Diskussion hier https://forums.spongepowered.org/t/plugin-hosting/1150 teilhaben.

source: What does this mean for the players?
de: Was für Auswirkungen hat das auf die Spieler?

source: Players should not notice anything different about the servers you know and love. Sponge is just an API that allows developers to create plugins just like before when using bukkit.
de: Spieler sollten davon, auf den Servern die sie kennen und mögen, nichts mitbekommen.Sponge ist einfach eine API die es Entwicklern erlaubt Plugins dafür zu erstellen. So wie es Bukkit war.

source: Will I need Forge to connect to a Sponge server?
de: Werde ich Forge brauchen um auf Sponge Server zu kommen?

source: No modification to your client is needed, just launch and play like normal!
de: Keine Modifikationen werden benötigt. Einfach starten und normal, wie immer, spielen!

source: What are Sponge mods
de: Was sind Sponge Mods?

source: Sponge mod is not currently avalible but is still be planned for the future. These mods will preform a variety of functions related to the client.
de: Sponge Mods sind derzeit nicht verfügbar, aber sind für die Zukunft geplant.Diese Mods werden viele verschiedene Funktionen für den Client haben.

source: What does this mean for the server owners?
de: Was bedeutet dies für die Server Besitzer?

source: Server owners will have to download Sponge and start them like any other Minecraft server.
de: Server Besitzer brauchen Sponge nur zu downloaden und zu starten, wie jeder andere Minecraft Server.

source: What Java version is Sponge using?
de: Welche Java Version benutzt Sponge?

source: Sponge will be using Java 1.6, which is the minimum version supported by vanilla Minecraft and Forge.
de: Sponge wird die Java Version 1.6 nutzen, welche die Minimumversion ist, die von Minecraft und Forge unterstützt wird.

source: Will players need the Forge client to connect?
de: Brauchen Spieler den Forge Client um auf den Server zu kommen?

source: If Sponge is used on the server, players who join will not need Sponge or Forge installed on their game. You can use Sponge to make management of your server easier, by allowing you to protect areas, log what players (or even friends) do, add minigames, and so on.
de: Wenn Sponge auf dem Server genutzt wird brauchen Spieler weder Forge noch Sponge.Du kannst Sponge nutzen um das Verwalten deines Servers zu vereinfachen, z.B. durch das Erlauben Regionen zu protecten (schützen), protokollieren was Spieler / Freunde tun, Minispiele hinzufügen und vieles mehr.

source: What Minecraft version is Sponge be first available for?
de: Für welche Minecraft Version wird Sponge als erstes verfügbar sein?

source: Sponge will be first available for Minecraft 1.8, or whatever 1.8.x version exists at the time.
de: Sponge wird als erstes für Minecraft 1.8 verfügbar sein, oder welche 1.8.x Version zu dieser Zeit existiert.

source: Will Bukkit Plugins work with Sponge
de: Werden Bukkit Plugins mit Sponge funktionieren?

source: While Sponge will not be directly supporting Bukkit, community projects have been started that aim to provide complete support for existing Bukkit plugins on top of Sponge.
de: Da Sponge Bukkit Plugins nicht direkt unterstützt haben sich Communityprojekte gebildet, deren Ziel es ist die Bukkit Plugins für Sponge verfügbar zu machen.

source: But Forge doesn’t support unmodified vanilla clients?
de: Aber Forge unterstützt doch garkeine nicht modifizierten Minecraft Clients?

source: At this time, yes, but LexManos has expressed plans in adding support for vanilla clients.
de: Zurzeit ja, aber LexMancs hat gesagt, dass die Entwickler eine Untersützung von nicht-modifizierten Clients planen und einbauen wollen.

source: But Forge takes too long to update?
de: Aber bei Forge dauert es so lange, bis Updates erscheinen?

source: With a large portion of the Minecraft community working together, we are sure we can help speed up things.
de: Mit der großen Minecraft Community die zusammenarbeitet, sind wir sicher, dass wir die Updateprozesse stark beschleunigen können.

source: I haven't kept up, what happened to Bukkit?
de: Ich habe nicht aufgepasst, was ist mit Bukkit passiert?

source: One of the contributors to Bukkit sent a DMCA take down notice to have Bukkit removed. He was within his legal right. Downloads, as well as source code, for Bukkit and its derivatives (Spigot, Cauldron) are no longer available.
de: Einer der Bukkitmitarbeiter hat einen DMCA Takedown (Rechtliche Klage) eingesendet um Bukkit zu entfernen. Er war dabei im Recht. Downloads, sowie der Sourcecode, für Bukkit und ähnliche (Spigot, Cauldron) sind nicht mehr verfügbar.

source: Who?
de: Wer?

source: Who is involved with this effort?
de: Wer ist in diese Anstrenungen mit einbezogen?

source: sk89q (of WorldEdit/WorldGuard) - project lead
de: sk89q (Macher von WorldEdit/WorldGuard) - Projektleiter

source: blood (of MCPC+/Cauldron) - project lead
de: blood (Macher von MCPC+/Cauldron) - Projektleiter

source: LexManos (of Forge/FML/MCP)
de: LexManos (Macher von Forge/FML/MCP)

source: Portions of the Spout team: Zidane, Raphfrk, DDoS, Sleaker, Owexz, Wulfspider
de: Teile des Spoutteams: Zidane, Raphfrk, DDoS, Sleaker, Owexz, Wulfspider

source: Portions of the Flow team: kitskub
de: Teile des Flowteams: kitskub

source: Portions from ForgeEssentials: AbrarSyed
de: Teile des ForgeEssentialsteams: AbrarSyed

source: Other Bukkit Plugin developers: KHobbits, Elgarl, zml
de: Andere Bukkit Plugin Entwickler: KHobbits, EdgarL, zml

source: Portions of the FTB team: progwml6
de: Teile des FTBteams: progwml6

source: Some previous contributors to Bukkit
de: Einige frühere Mitarbeiter von Bukkit

source: Other people we have likely failed to mention
de: Andere Leute, die wir vermutlich vergessen haben zu erwähnen.

source: However, we are interested in talking with anyone who is able to help.
de: Jedoch sind wir sehr interessiert daran mit jedem zu reden, der möglicherweise helfen kann.

source: How are decisions made?
de: Wie werden Entscheidungen gefällt?

source: The project owners, **blood** and **sk89q**, after consulting with the community and other members when appropriate, will make the decisions.
de: Die Projektleiter, **blood*** und **sk89q**, nach Beratungen mit der Community und anderen Mitgliedern, wenn Angemessen, fällen Entscheidungen.

source: Have you consulted the community?
de: Habt ihr die Community befragt?

source: Yes! While things have been moving pretty quickly, we’re very open to input. Many of our decisions are based on discussion in the #nextstep IRC channel (on EsperNet) as well as the results of a survey. We have been collecting meeting notes and consensus on a Google document.
de: Ja! Da die Dinge sehr schnell gehen, sind wir sehr offen für Vorschläge. Viele unserer Entscheidungen basieren auf Entscheidungen von dem #nextstep IRC channel (auf EsperNet) sowie den Ergebnissen von Umfragen. Wir hatten Meetings und Einigkeiten von Umfragen in Google Dokumenten.

source: Technical Questions
de: Technische Fragen

source: Why not use a "Wrapper"-styled API?
de: Warum nutzt ihr nicht eine "Wrapper"-styled API?

source: A wrapper that merely works on network packets and reuses command blocks is extremely limited in function, so plugins would only be able to do a fraction of what they are able to do now.
de: Ein Wrapper der lediglich mit Netzwerkpaketen und Commandblöcken arbeitet ist sehr limitiert in seinem Funktionsumfang. Viele Plugins würden dann nur einen winzigen Teil der Funktionen beinhalten.

source: Why not build a standalone server?
de: Warum entwickelt ihr nicht einen eigenständigen (und von Grund auf neu entwickelten) Server?

source: Reusing existing efforts in the community will allow us to have a working version much quicker. Glowstone, unfortunately, is not free from the EULA as it was not written in a “clean-room” fashion (in the strictest sense of the term). Other implementations are less far along or they do not support Java, which appears to be a major point of contention for a lot of users and developers. None of us have the time to write a new server from scratch, and most of us have already seen Minecraft’s code in some form.
de: Das Nutzen von Produkten aus der Community macht es für uns schneller möglich eine Version fertig zu haben. Glowstone ist leider nicht frei von der EULA, da es nicht von Grund auf neu programmiert wurde. Jedoch sind andere Minecraft Server Softwares entweder nicht in Java, oder sie sind nicht so langlebig. Java ist für Spieler, Serverbesitzer und Entwickler die einfachste Lösung, da sie sich damit auskennen. Leider hat keiner von uns Zeit einen neuen Server von Grund auf zu programmieren.

source: Doesn’t that mean that we will end up in this same situation again if we use proprietary code?
de: Heißt das nicht, dass wir in der gleichen Situation wie Bukkit landen, wenn wir Code von anderen nutzen?

source: It is to our knowledge and our understanding that Mojang does not wish to stop Minecraft modding, and the recent events have not been directly caused by them. Rather, a contributor (a major one) objected to the use of his code, licensed under GPL, in combination with proprietary code. If we avoid GPL, we will not have this problem. While this does not free us from Mojang’s control, it is to our belief that they support modding and will continue to do so.
de: Es ist unserer Meinung nach von Mojang nicht gewünscht, dass das Minecraft Modding aufhört. Außerdem gingen die letzten Ereignisse nicht von ihnen aus, sondern Mitarbeiter von Bukkit, der nicht möchte, dass sein Code genutzt wird, da er unter der GPL Lizenz steht. Wenn wir keine GPL Lizenz nutzen, haben wir das Problem also nicht. Dies befreit uns allerdings nicht von der Kontrolle durch Mojang. Deshalb hoffen wir alle, dass Sie weitere an Minecraft Modding glauben und es gutheißen, sodass wir weiter machen können.

source: Why not wait for the Official Minecraft API?
de: Warum warten wir nicht auf die offizielle Minecraft Modding API?

source: We are not sure when it will come out. Many people are not in a position to wait. We can get started sooner. Those last three bullet points may have said the same thing. As this new project is community-run, we may be able to push updates quicker than Mojang is able to and react to the needs of the community better. The API may be implemented on other server implementations and we encourage it.
de: Wir sind nicht sicher, wann diese erscheinen wird. Viele Leute können nicht warten. Wir können damit schneller fertig sein. Außer diesen drei Punkten sind wir als Community schneller fähig Updates zu machen, da wir zusammen arbeiten.Vielleicht ermutigen wir Mojang auch mit unserer API und der guten Community dazu ihre API schneller fertig zu stellen. Wir werden sehen.

source: What license will Sponge be placed under?
de: Unter welcher Lizenz wird Sponge stehen?

source: MIT, without a Contributor License Agreement. A Contributor License Agreement is not necessary and it may be a turn off to contributors.
de: MIT, ohne eine Mitarbeiter Lizenz Vereinbarung. Eine Mitarbeiter Lizenz Vereinbarung ist nicht notwendig und es ist vielleicht abschreckend für Mitarbeiter.

source: Why not use Bukkit’s API?
de: Warum benutzen wir nicht die Bukkit API?

source: It contains GPL licensed code, which is the reason why we are in this situation. Recently, at least in the United States, the federal courts found that APIs could be copyrighted, although the case has not been fully resolved. Will the new API be similar to the Bukkit API in how it is used? Events, etc.? Yes. It should be fairly similar, and still afford you more power because you will have access to Forge.
de: Sie enthält GPL lizensierten Code, welcher der Grund dafür ist, warum wir in dieser Situation sind. Letztens, zumindest in den USA, haben die Bundesgerichte klargemacht, dass APIs unter Copyright stehen können.(Neue Frage - Fehler in der Originalsprache)Wird die neue API so ähnlich wie Bukkit zu benutzen sein? Events, etc.?Ja. Es sollte sehr ähnlich sein, aber dennoch mehr bieten, da wir Zugriff auf Forge haben.

source: Why SpoutAPI (+ Flow libs) versus Canary or other APIs?
de: Warum SpoutAPI (+ Flow libs) gegen Canary oder andere APIs?

source: We chose SpoutAPI purely based on the result of the survey (which is mentioned previously). Note, however, we are not implementing SpoutAPI as-is. It will serve as inspiration, which will reduce the amount of time spent on API design. We will also use portions of flow’s libraries from http://github.com/flow.
de: Wir haben die SpoutAPI nur ausgewählt, da sie das Ergebnis der Umfrage war. Wir betten allerdings nicht die SpoutAPI in unser API Design ein. Wir werden Teile der Flow Bibilothek von http://github.com/flow nutzen.

source: What about plugins that access ‘NMS’?
de: Was ist mit Plugins die auf 'NMS' zugreifen?

source: You will instead be accessing interfaces through Forge, which has a much greater number of names de-obfuscated. However, accessing “NMS” raises the risk of your plugin breaking as is the case here, but that is your prerogative.
de: Du wirst auf Interfaces von Forge zugreifen müssen, welche viel besser sind und deren Namen auch nicht 'verschleiert' sind. Dennoch wird das Zugreifen auf 'NMS' die Wahrscheinlichkeit erhöhen, dass dein Plugin nicht mehr funktionieren könnte. Das ist deine Entscheidung und dein Problem.

source: Will the new server be multi-threaded?
de: Wird die Serversoftware multi-threaded sein?

source: It will be multi-threaded in the same fashion that is Minecraft is (and also Bukkit and Spigot was), but we are not writing a server from scratch, so we are not able to make substantial changes.
de: Es wir genauso multi-threaded sein wie Minecraft ist und Bukkit und Spigot es waren, aber wir schreiben den Server nicht von Grund auf neu, sodass wir dabei keine riesiegen Änderungen machen können.

source: How will the new server perform in comparison with Spigot and Bukkit?
de: Wie wird die Serverperformance im Vergleich zu Bukkit und Spigot sein?

source: We are currently investigating this, but we plan to reach or exceed performance of the other implementations given time.
de: Wir untersuchen das zurzeit, aber wir planen die Perfomance dieser zu erreichen oder sogar zu übertreffen.

source: Will you be able to send mods from the server to the client?
de: Wird es möglich sein Mods vom Server an den Client zu senden?

source: The general consensus is against this due to security concerns. Minecraft’s API does not plan to send mods (with executable code) to the client either.
de: Die Mehrheit ist dagegen, da dies viele Sicherheitsrisiken mit sich bringt. Minecrafts API plant auch nicht Mods sendbar zu machen.

source: Will Bukkit plugins be supported, without modification?
de: Werden Bukkit Plugins unterstützt, die nicht verändert wurden?

source: No, not natively, however members of the community have begun work on a Sponge plugin named Pore that acts as a bridge between the two APIs.
de: Nein, sie werden nicht unterstützt. Jedoch programmieren Mitglieder der Community viele Plugins zu einem Spongeplugin um. Außerdem haben einige ein Plugin namens Pore erstellt, welches eine Brücke zwischen der Sponge und Bukkit API bildet.

source: For those unable to use it, we will be providing documentation and support for people looking to transition from Bukkit to Sponge entirely.
de: Für Leute, die dieses nicht verwenden können bieten wir eine Dokumentation und Unterstützung an, damit sie Bukkit Plugins auf Sponge verwenden können.

source: Will I be able to keep my Bukkit worlds and data?
de: Wird es möglich sein, dass ich meine Bukkitwelten und andere Daten behalten kann?

source: The plan is to create a conversion process which will convert or import as much data as possible. Plugins will likely create their own conversion process allowing you to keep homes, warps and other data.
de: Der Plan ist es, einen konvertierungs Prozess einzubauen, der deine Daten und Welten importiert. Plugins haben eventuell auch solch einen Prozess, um Homes, Warps und andere Daten behalten zu können. Dies hängt allerdings vom Entwickler ab.

source: What about support for Scala, Groovy, and other JVM-based languages?
de: Was ist mit Unterstützung für Scala, Groovy und andere JVM-basierte Sprachen?

source: We encourage other languages but Java will be our main priority. Will other programming languages (such as Lua) be supported? We will encourage other implementations but it will not be a high priority.
de: Wir setzen uns für andere Sprachen ein, aber Java wird unsere Hauptsprache bleiben. (Neue Frage - Fehler in der Originalsprache)Werden andere Programmiersprachen (wie Lua) unterstützt?Wir setzen uns dafür ein, aber es ist nicht von höchster Priorität.

source: Will Glowstone be a part of this?
de: Wird Glowstone ein Teil von Sponge sein?

source: We hope we can help SpaceManiac and the team implement the API. We also invite others to collaborate with us if they wish to.
de: Wir hoffen, dass wir SpaceManiac und dessen restlichen Team helfen können die API einzubauen. Wir werden außerdem andere Entwickler einladen mit uns zusammen zu arbeiten.

source: I wish to help out.
de: Ich möchte gerne mithelfen!

source: We appreciate all offers of assistance. Please visit our volunteers portal:
de: Wir schätzen dein Hilfsangebot sehr. Bitte besuche unsere Seite dafür:

source: We apologise to anyone who did not receive a reply to earlier rounds of applications. The number of sumbissions was overwhelming, thank you all!
de: Wir entschuldigen uns dafür, falls jemand keine Antwort auf frühere Bewerbungen bekommen hat. Die Anzahl der Einsendugen war sehr groß. Vielen Dank an euch alle!
