Repository: SpongePowered/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: de

source: Welcome to the Sponge documentation!
de: Willkommen bei der Sponge-Dokumentation

source: Contents:
de: Inhalt:

source: **Sponge** is an all-new Minecraft modding API created by a team of top minds in both the server and client modding communities. The Sponge project welcomes new contributions from players and developers alike. The Sponge API will have an official Minecraft Forge-based implementation designed to be an easy-to-use addition to your server.
de: **Sponge** ist eine komplett überarbeitete Minecraft Modifikations-API erstellt von einem Team von klugen Köpfen aus der Server- und Clientmodifikationscommunity. Das Sponge Projekt begrüßt neue Beiträge von Spielern und Entwicklern sehr gern. Die Sponge API wird eine offizielle Minecraft Forge basierte Einbettung haben, die eine sehr einfach zu benutzende Erweiterung zu deinem Server sein kann.

source: Sponge will be available for free to both server owners and plugin developers at the Downloads page at :doc:`downloads`.
de: Sponge wird kostenlos verfügbar sein für Serverbesitzer und Pluginentwickler. Zu finden ist es unter der Downloadsseite hier: :doc:`downloads`.

source: *The Sponge API and its Forge implementation are still under development and not available at this time.*
de: *Die Sponge API und ihre Forgeeinbettung sind noch in Entwicklung und derzeit nicht verfügbar.*

source: If this is your first time here, you probably have a lot of questions to ask. We have tried to answer as many as possible in our :doc:`faq`. Take a moment to browse it before heading onward to the specifics.
de: Falls das dein erster Besuch hier ist, könntest du vielleicht viele Fragen haben. Wir haben versucht so viele Fragen wie Möglich in unserem :doc:`faq` zu beantworten. Nimm dir einen Moment zeit um dort durchzuschauen, bevor du weiter zu den Einzelheiten weiter gehst.

source: Sponge for players
de: Sponge für Spieler

source: Will I need to use a Forge client and sponge too?
de: Brauche ich Forge und Sponge?

source: You can log in to a Minecraft Server running Sponge with any Minecraft Client of the right MC version. It will not require players to have either Forge or Sponge installed. Minecraft Forge for 1.8 will allow vanilla clients to connect. Sponge should work much the same as CraftBukkit did in this respect.
de: Du kannst dich in einen Minecraftserver einloggen, der mit Sponge läuft, mit jedem Minecraftclient mit der richtigen Version. Es wird nicht von Spielern verlangt werden, dass sie Forge oder Sponge installiert haben. Minecraft Forge für Version 1.8 wird es normalen 'vanilla' Clients erlauben sich auf den Server zu verbinden. Sponge sollte auch so funktionieren wie CraftBukkit.

source: What about my favourite Bukkit plugins?
de: Was ist jetzt mit meinen lieblings Bukkit Plugins?

source: Server Plugins must be written to use the Sponge API, or employ some kind of compatibility layer to run (eg. Pore). A large number of Bukkit plugin developers have offered to port their work to Sponge when it is ready. For more information, please visit :doc:`bukkit-compatibility`.
de: Server Plugins müssen neugeschrieben werden, damit sie mit Sponge funktionieren, oder eine Art von Funktionalitäten haben um dort zu laufen (wie z.B. Pore). Viele Bukkit Plugin Entwickler haben angeboten ihre Plugins auf Sponge zu übertragen, wenn es fertig ist. Für mehr Informationen besuche bitte :doc:`bukkit-compatibility`.

source: Sponge for server admins
de: Sponge für Server Administratoren

source: :doc:`admins/admins` - A central resource for all things related to server administration.
de: :doc:`admins/admins` - Eine zentrale Quelle für alles was zur Serveradministration gehört.

source: :doc:`faq` - Frequently asked questions about Sponge.
de: :doc:`faq` - Häufig gestellte Fragen über Sponge.

source: :doc:`bukkit-compatibility` - What's changed? Will my old stuff work?
de: :doc:`bukkit-compatibility` - Was hat sich geändert? Werden alte Sachen funktionieren?

source: :doc:`forge-mods` - What's the deal with Forge mods? Do they work with Sponge?
de: :doc:`forge-mods` - Was hat es mit Forge Mods auf sich? Funktionieren sie mit Sponge?

source: :doc:`admins/server-setup` - Guide on how to start your very own server using Sponge.
de: :doc:`admins/server-setup` - Leitfaden dazu, wie du deinen eigenen Server starten kannst indem du Sponge nutzt.

source: :doc:`troubleshooting` - Find answers to the most common problems that occur here.
de: :doc:`troubleshooting` - Finde Antworten zu den häufigsten Problemen, die hier auftreten können.

source: Sponge for plugin developers
de: Sponge für Plugin Entwickler

source: :doc:`developers/developers` - A central resource for all things related to plugin development
de: :doc:`developers/developers` - Eine zentrale Quelle für alles was zur Plugin Entwicklung gehört.

source: :doc:`developers/setting-up-workspace` - Guide on how to set up your IDE to start coding with the Sponge API
de: :doc:`developers/setting-up-workspace` - Leitfaden dazu, wie du deine IDE aufsetzen musst um mit dem Programmieren mit der Sponge API beginnen zu können

source: :doc:`developers/sponge-tutorials` - Guides and tutorials for working with the Sponge API
de: :doc:`developers/sponge-tutorials` - Leitfäden und Tutorials zum Arbeiten mit der Sponge API

source: :doc:`developers/event-api` - Detailed documentation and examples on the event system.
de: :doc:`developers/event-api` - Detaillierte Dokumentationen und Beispiele zum Eventsystem.

source: `Sponge API <https://github.com/SpongePowered/SpongeAPI>`__ - Official Github for the Sponge API.
de: `Sponge API <https://github.com/SpongePowered/SpongeAPI>`__ - Offizielle Githubseite für die Sponge API.

source: Sponge development portal
de: Sponge Entwickler Raum

source: Guides and help resources
de: Leitfäden und Hilfsquellen

source: :doc:`sponge-archivist` - How to get involved in making this Wiki
de: :doc:`sponge-archivist` - Wie du mithelfen kannst diese Wiki zu verbessern

source: :doc:`../bukkit-compatibility` - Documentation on starting and maintaining a server.
de: :doc:`../bukkit-compatibility` - Dokumentationen über das Starten und Aufrechterhalten eines Servers.

source: `Issue Tracker <https://github.com/SpongePowered/SpongeAPI/issues?q=>`__ - The list of issues related to the Sponge API.
de: `Issue Tracker <https://github.com/SpongePowered/SpongeAPI/issues?q=>`__ - Eine Auflistung von Fehlern der Sponge API.

source: :doc:`../changelog` - The list of changes between Sponge releases
de: :doc:`../changelog` - Eine Auflistung von Änderungen zwischen den Spongeversionen

source: :doc:`developers/developers` - Documentation and information to develop applications to work with *Sponge*.
de: :doc:`developers/developers` - Dokumentationen und Informationen zum entwickeln von Anwendungen, die mit *Sponge* laufen.

source: Links to external resources
de: Links zu anderen Quellen

source: `Sponge Forums <http://forums.spongepowered.org>`__
de: `Sponge Forum <http://forums.spongepowered.org>`__

source: Indices and tables
de: Indizes und Tabellen
