Repository: SpongePowered/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/troubleshooting.po
Languages: de

source: Troubleshooting
de: Fehlerbehebung

source: You're probably here because something went wrong with your Sponge server. Let's see if we can figure out what it was, and what to do about it. If you haven't done so already, we recommend reading :doc:`bukkit-compatibility`.
de: Du bist vermutlich hier, da irgendetwas mit deinem Sponge Server schief gegangen ist. Lass uns überprüfen ob wir herausfinden können, was und warum es schief gegangen ist. Falls du es nicht schon getan hast, empfehlen wir dir :doc:`bukkit-compatibility` zu lesen.

source: Java is not installed on your Computer
de: Java ist nicht auf deinem Computer installiert

source: **Solution**: Download and install the latest version of the Java Runtime Environment (JRE) available for your operating system. Sponge (and Minecraft) are built on Java 6, however you are recommended and encouraged to use Java 7. Java 8 does not currently have widespread usage so installing it is not recommended. Oracle Java is a good option for most Operating Systems.
de: **Lösung**: Downloade und installiere die neueste Version der Java Runtime Environment (JRE), welche für dein Betriebssystem verfügbar ist. Sponge (und Minecraft) sind auf Java 6 aufgebaut, trotzdem empfehlen wir dir Java 7 zu nutzen. Java 8 ist derzeit nicht weit verbreitet und enthält eventuell ein paar kleinere Fehler, weshalb wir dir die Benutzung davon nicht empfehlen. Java von Oracle zu beziehen ist, in den meisten Fällen, die beste Entscheidung.

source: Network connection failure (or DDoS attack)
de: Netzwerk Verbindung fehlgeschlagen (oder DDoS Attacke)

source: **Symptoms**: Network connection is very laggy, drops in and out, or absent.
de: **Symptome**: Deine Internetverbindung ist sehr langsam, geht an und aus oder fehlt sogar ganz.

source: **Solutions**: Check your connection to the modem or router. See if your browser has similar troubles. You can use a free service like speedtest.net to check your connection speed. Other services running on your computer or local network may the cause. A DDoS attack will probably completely kill your connectivity, and you should contact your ISP if you believe this to be the case.
de: **Lösung**: Überprüfe deine Verbindung zum Modem bzw. Router. Checke ob dein Browser gleiche Probleme hat. Du kannst kostenlose Services wie speedtest.net nutzen um deine Verbindungsgeschwindigkeit zu testen. Andere Programme, die auf deinem PC oder in deinem Netzwerk laufen könnten das Problem sein. Eine DDoS Attacke würde vermutlich deine komplette Internetverbindung unterbrechen und du solltest auf jeden Fall deinen Provider kontaktieren, wenn du dir 100% sicher bist, dass es sich um eine DDoS Attacke handelt.

source: Not enough free memory
de: Nicht genug freien Arbeits-Speicher

source: **Symptoms**: Server crashes, often accompanied with "Out of Memory" messages.
de: **Symptome**: Server crasht, oft begleitet von "Out of Memory" Nachrichten.

source: **Solutions**: Expand the maximum Perm memory size with the startup argument ``-XX:MaxPermSize=128``. Expand your server heap memory (if possible) with startup arguments eg. ``-Xms1024M`` (1GB starting memory) and ``-Xmx2048M`` (2GB maximum). Monitor your free memory on the computer and see if there is some locked up in other processes. You may need to kill frozen java processes, or restart your machine. Memory leaks sometimes occur with bugs in plugins, which can take time to isolate.
de: **Lösung**: Erweitere deinen maximalen Arbeits-Speicher für Sponge indem du das Startup Argument `-XX:MaxPermSize=128`` ersetzt mit einem Argument wie ``-Xms1024M`` (für 1GB Arbeits-Speicher) oder ``-Xmx2048M`` (für 2GB Arbeits-Speicher). Kontrollier den freien Arbeitsspeichers deines PCs und schau nach ob nicht irgendwelche Prozesse laufen, die viel Arbeits-Speicher ziehen. Vielleicht musst du auch eingefrorene Java Prozesse beenden oder sogar deinen PC neustarten, damit du wieder freien Arbeits-Speicher hast. Einige Speicherprobleme können in Plugins auftreten. Allerdings wird es eventuell lange dauern bis diese behoben werden können.

source: Malformed config file (eg. bad editing)
de: Falsch geformte Konfigurationsdatei (z.B. durch falsches Beabeiten)

source: **Symptom**: One (or more) plugins refuse to load, or behave in unexpected ways. The server log files will contain messages about unreadable files on startup. The server may crash, and data may be corrupted.
de: **Symptome**: Ein (oder mehrere) Plugin(s) laden nicht oder verhalten sich komplett anders als erwartet. Die Server Protokoll Datei wird mit Sicherheit Nachrichten über nicht lesbare Dateien enthalten. Der Server könnte eventuell crashen oder Dateien könnten beschädigt sein / werden.

source: **Solution**: Stop the server, and check your edited files. Load backup files of any corrupted data. You may need to delete a config file entirely and allow it to regenerate server startup.
de: **Lösung**: Stopp den Server und überprüfe deine bearbeiteten Dateien. Lade Backupdateien der kaputt gegangenen Dateien. Du musst eventuell sogar eine Konfigurationsdatei löschen um dem Server / Plugin es zu gestatten eine neue zu generieren.

source: A plugin (or mod) has malfunctioned
de: Ein Plugin (Oder Mod) hat eine Fehlfunktion

source: **Symptom**: This could be almost anything - whatever your plugins do, plus the X-factor. Commonly the server crashes with a train of error messages in the server log files.
de: **Symptome:** Das könnte fast alles sein - egal was deine Plugins tun. Normalerweise crasht der Server mit sehr vielen Fehlermeldungen in den Protokolldateien des Servers.

source: **Solution**: Stop the server, and check to see nothing has been corrupted. Be sure to check that it isn't from an incorrectly edited config file (above). Remove suspect plugins and add them again one by one, restarting the server each time. The problem may originate from one Plugin that is out of date - check for updates. Plugin conflict may also be the cause, having two incompatible plugins.
de: **Lösung**: Stop den Server und überprüfe ob nichts defekt ist. Stell sicher, dass es sich nicht um eine falsch bearbeitete Konfigurationsdatei handelt (Siehe oben). Entfern Plugins und füg sie nach und nach wieder hinzu - starte dazu den Server nach jedem Mal neu. Das Problem könnte bei einem Plugin liegen, dass nicht mehr aktuell ist - prüf ob Updates verfügbar sind. Plugin Konflikte könnten auch das Problem sein - prüf ob alle Plugins miteinander kompatibel sind.

source: Operating System is unstable (eg. Virus infection)
de: Betriebssystem ist instabil (z.B. durch eine Virus Infektion)

source: **Symptom**: The server keeps crashing or timing out, and other parts of your operating system are also having problems.
de: **Symptome**: Der Server crasht andauernd oder bekommt time outs. Andere Teile deines Betriebssystems haben ebenfalls Probleme und funktionieren nicht einwandfrei.

source: **Solution**: Stop everything. Thoroughly check your system and storage devices for malware and viruses. Good tools for this include AdwCleaner, Junkware Removal Tool, MalwareBytes, and most antivirus ware. Check your server files for corruption after a clean restart of your system. Examine the hardware for damage too if the problems persist - eg. a faulty power supply.
de: **Lösung**: Stopp alles. Prüf gründlich dein System und deine Festplatte auf Viren. Gute Werkzeuge dafür sind z.B. AdwCleaner, Junkware Removal Tool, MalwareBytes und viele Antivirusprogramme. Prüf deine Serverdateien und check ob nicht eine davon kaputt ist. Start dein System neu. Untersuch deine Hardware auf Schäden falls das Problem weiterhin besteht (z.B. zu wenig Strom / Kaputtes Netzkabel).

source: Corrupted Data
de: Beschädigte Dateien

source: **Symptom**: World files fail to load or cause server to crash when players enter certain chunks. Database corruption.
de: **Symptome**: Weltdateien können nicht geladen werden und der Server crasht wenn Spieler bestimmte Chunks betregen. Deine Datenbank ist beschädigt.

source: **Solution**: Load backup files of corrupted data. Software for repairing damaged worlds is available, and missing regions may be regenerated. Investigate the cause of corruption - was it a malformed plugin, database driver, power failure or something else? Always make sure you make regular backups of important data onto a secure device.
de: **Lösung**: Lad ein Backup deiner kaputten Dateien. Außerdem gibt es Software die kaputte Welten reparieren kann und zerstörte Regionen neu generieren kann. Untersuch den Grund der Zerstörung - War es ein kaputtes Plugin, der Datenbank Treiber, zu wenig Strom oder irgendetwas anderes? Stell immer sicher, dass du genug Backups auf einer zweiten Festplatte hast!

source: Problem between keyboard and chair
de: Probleme zwischen Tastatur und Stuhl.

source: **Symptom**: Everything was working fine yesterday. It went strange today after I did XYX ...
de: **Symptome**: Gestern hat alles noch gut funktioniert. Es wurde heute alles total komisch nachdem ich XYZ gemacht habe...

source: **Solution**: This wiki is not large enough to encompass the things people may do that will cause software to fail in unpredictable ways. It is always worth thinking long and hard about what you may have done recently that could have affected the smooth running of your server. A memory card may be loose after dusting, a shortcut may be broken...
de: **Lösung**: Diese Wikiseite ist nicht groß genug um alle Sachen zu umfassen, die Menschen tun könnten um Software so zu verändern, dass sie nicht mehr richtig funktioniert. Es ist immer sehr viel wert lange über etwas nachzudenken bevor man es tut. Vorallem wenn dein Server normalerweise problemlos läuft. Never touch a running System!

source: There is a bug in Sponge
de: Es gibt da einen Fehler in Sponge

source: **Symptom**: None of the above apply, and it still doesn't work as it should.
de: **Symptome**: Keines der oben genannten Probleme trifft zu und es funktioniert immernoch nicht so wie es soll.

source: **Solution**: Time to get out the big guns. File a report on the Sponge issue tracker, remembering to include details of the version of Forge and Sponge you are using, and a link to the relevant server log file.
de: **Lösung**: Es ist Zeit für die harten Geschütze. Start eine Fehlermeldung beim Sponge Fehlerverfolgungssystem, aber denk dran alle Details (Version von Forge und Sponge) sowie Protokolldateien mit einzubinden.

source: There is something wrong with the Universe
de: Da ist etwas mit dem Universum falsch

source: We can't help you with this one. You're on your own.
de: Wir können dir damit leider nicht helfen. Hier bist du auf dich allein gestellt :-(
