Repository: SpongePowered/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/general/bukkit-compatibility.po
Languages: de

source: Bukkit Compatibility
de: Bukkit Verträglichkeit

source: A bumpy path from Bukkit to Sponge
de: Ein unebener Pfad von Bukkit zu Sponge

source: Migrating your existing server, or setting up a new one, you want to know what you can keep and what to throw away. Bukkit and Craftbukkit made it easier for you as a Server Admin, and we hope that Sponge will fulfil the same role. However, there are many things that have changed.
de: Egal ob bei der Umstellung eines existierenden Servers oder beim Aufsetzen eines neuen. Du möchtest wissen, was du behalten kannst und was du wegschmeißen musst? Bukkit und CraftBukkit haben es sehr einfach für dich, als Serveradmin, gemacht und wir hoffen, dass Sponge das gleiche tun kann. Jedoch haben sich einige Sachen geändert.

source: Will Bukkit plugins still work?
de: Funktionieren Bukkit Plugins immernoch?

source: **NO**.
de: **NEIN**.

source: Server Plugins for Sponge must be written to use the Sponge API, or employ some kind of compatibility layer to run (eg. Pore, still a work-in-progress). A large number of Bukkit plugin developers have offered to port their work to Sponge when it is ready. There is an extensive list available on the Sponge Forums.
de: Server Plugins müssen neugeschrieben werden, damit sie mit Sponge funktionieren, oder eine Art von Funktionalitäten haben um dort zu laufen (wie z.B. Pore). Viele Bukkit Plugin Entwickler haben angeboten ihre Plugins auf Sponge zu übertragen, wenn es fertig ist. Es gibt eine lange Liste davon auf dem Forum.

source: For more information on the Sponge server, please read :doc:`admins/implementations`.
de: Für mehr Informationen über den Sponge Server lies bitte hier weiter: :doc:`admins/implementations`.

source: What about other tools?
de: Was ist mit anderen Tools / Werkzeugen?

source: Anything that relies on the Bukkit API is a dead duck. Sponge needs a completely blank slate to work with, and will not be implementing the old Bukkit functions as they were. New methods will be developed and made available to supplant them, but this process will take time.
de: Alles das über die Bukkit API läuft funktioniert jetzt nicht mehr. Sponge braucht ein komplett neues System und läuft nicht mit den alten Bukkit Funktionen. Neue Methoden werden entwickelt und gemacht um die von Bukkit zu ersetzen, jedoch dauert das noch etwas.

source: For example, drdanick's magnificent RemoteToolKit. It won't work, because it needs a plugin to interact with the server API.
de: Zum Beispiel funktioniert auch DrDanicks großartiges RemoteToolKit nicht, da es ein Plugin nutzt, dass auf die Server API (von Bukkit) zugreift.

source: Dynmap *will* work with Minecraft Forge, but will not be able to interact with Sponge until it is updated to use the Sponge API.
de: Dynmap *funktioniert* mit Minecraft Forge, aber kann nicht mit Sponge arbeiten, bis es vom Entwickler für Sponge umprogrammiert ist.

source: MCEdit and other common Minecraft tools will work as usual. Sponge won't affect your save files.
de: MCEdit und andere bekannte Minecraft-Tools funktionieren wie normal, da sie nichts mit Sponge zutun haben.
